Tekla Open API Reference for Tekla Structures 2025
IDoubleDataType.Value Property
 The double value of the field.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
double Value { get; set; }
Property Value As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
IDoubleDataType Interface
Tekla.Structures.Datatype Namespace